---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToMakeSourceWorksetEditable
source: html/58767307-68c8-1db4-443c-935b6d7ade3e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.UnableToMakeSourceWorksetEditable Property

Unable to make the necessary Workset ([Name]) editable in the Linked File in order to change the Shared Coordinates.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToMakeSourceWorksetEditable { get; }
```